{
  "htmlTopics": [
    {
      "id": 101,
      "title": "HTML Basics",
      "subtopics": [
        "Introduction to HTML",
        "HTML Tags",
        "Document Structure",
        "Basic HTML Elements",
        "HTML Attributes",
        "HTML Formatting",
        "Comments in HTML"
      ]
    },
    {
      "id": 102,
      "title": "HTML Forms",
      "subtopics": [
        "Form Structure",
        "Form Input Types",
        "Form Validation",
        "Form Submission",
        "Form Controls",
        "Form Accessibility",
        "HTML5 Form Features"
      ]
    },
    {
      "id": 103,
      "title": "HTML Tables",
      "subtopics": [
        "Table Structure",
        "Table Formatting",
        "Table Borders",
        "Table Cells",
        "Table Headers",
        "Table Caption",
        "HTML5 Table Features"
      ]
    },
    {
      "id": 104,
      "title": "HTML Links",
      "subtopics": [
        "Anchor Tags",
        "Link Types",
        "Link Targets",
        "Link Accessibility",
        "HTML5 Link Features"
      ]
    },
    {
      "id": 105,
      "title": "HTML Images",
      "subtopics": [
        "Image Tags",
        "Image Attributes",
        "Image Accessibility",
        "HTML5 Image Features"
      ]
    },
    {
      "id": 106,
      "title": "HTML Semantic Elements",
      "subtopics": [
        "Semantic HTML",
        "HTML5 Semantic Elements"
      ]
    },
    {
      "id": 107,
      "title": "HTML Layout",
      "subtopics": [
        "Div vs. Span",
        "Box Model",
        "CSS Layout Techniques",
        "HTML5 Layout Elements"
      ]
    },
    {
      "id": 108,
      "title": "HTML Accessibility",
      "subtopics": [
        "Web Accessibility Standards",
        "Accessible HTML",
        "ARIA Roles",
        "ARIA States and Properties"
      ]
    },
    {
      "id": 109,
      "title": "HTML Meta Tags",
      "subtopics": [
        "HTML Meta Tags",
        "SEO Best Practices",
        "Social Media Meta Tags",
        "Viewport Meta Tag"
      ]
    },
    {
      "id": 110,
      "title": "HTML Multimedia",
      "subtopics": [
        "Audio and Video Tags",
        "Media Attributes",
        "HTML5 Media Features"
      ]
    },
    {
      "id": 111,
      "title": "HTML5 APIs",
      "subtopics": [
        "Geolocation API",
        "Drag and Drop API",
        "Canvas API",
        "Web Storage API",
        "Web Workers API",
        "WebSockets API"
      ]
    },
    {
      "id": 112,
      "title": "HTML5 Forms",
      "subtopics": [
        "New Form Input Types",
        "Form Attributes",
        "Form Elements",
        "Form Validation"
      ]
    },
    {
      "id": 113,
      "title": "HTML5 Audio and Video",
      "subtopics": [
        "Audio and Video Tags",
        "Media Elements",
        "Media Events",
        "Media Formats"
      ]
    },
    {
      "id": 114,
      "title": "HTML5 Canvas",
      "subtopics": [
        "Canvas API"
      ]
    },
    {
      "id": 115,
      "title": "HTML5 Geolocation",
      "subtopics": [
        "Geolocation API",
        "Geolocation Properties",
        "Geolocation Methods",
        "Geolocation Events"
      ]
    },
    {
      "id": 116,
      "title": "HTML5 Drag and Drop",
      "subtopics": [
        "Drag and Drop API",
        "Drag and Drop Events",
        "Drag and Drop Properties"
      ]
    },
    {
      "id": 117,
      "title": "HTML5 Web Storage",
      "subtopics": [
        "Web Storage API",
        "Local Storage",
        "Session Storage"
      ]
    },
    {
      "id": 118,
      "title": "HTML5 Web Workers",
      "subtopics": [
        "Web Workers API",
        "Worker Object",
        "Communication with Workers"
      ]
    },
    {
      "id": 119,
      "title": "HTML5 WebSockets",
      "subtopics": [
        "WebSockets API",
        "WebSocket Object",
        "WebSocket Events",
        "WebSocket Protocol"
      ]
    },
    {
      "id": 120,
      "title": "HTML5 SVG",
      "subtopics": [
        "SVG Tags",
        "SVG Attributes",
        "SVG Elements",
        "SVG Filters"
      ]
    },
    {
      "id": 121,
      "title": "HTML5 Responsive Design",
      "subtopics": [
        "Media Queries",
        "Responsive Images",
        "Viewport Meta Tag",
        "Flexible Grids",
        "Fluid Layouts"
      ]
    },
    {
      "id": 122,
      "title": "HTML5 Offline Web Applications",
      "subtopics": [
        "Application Cache",
        "Manifest File",
        "Offline Events"
      ]
    },
    {
      "id": 123,
      "title": "HTML Email Development",
      "subtopics": [
        "Email Design",
        "HTML Email Structure",
        "CSS in Emails",
        "Responsive Email Design"
      ]
    },
    {
      "id": 124,
      "title": "HTML Best Practices",
      "subtopics": [
        "HTML Coding Standards",
        "SEO Best Practices",
        "Web Accessibility Best Practices"
      ]
    }
  ],
  "topicDetails": [
    {
      "id": "1",
      "title": "Introduction to HTML",
      "description": "HTML (HyperText Markup Language) is a markup language used to create and structure content on the internet. It is the standard language for building web pages and is used to create and describe the content and layout of a website.\n\nHTML documents consist of a series of elements, which are used to define the structure and content of a web page. These elements are represented by tags, which are enclosed in angle brackets. For example, the \"<html>\" tag is used to define the beginning of an HTML document, while the \"<body>\" tag is used to define the main content of the page.\n\nHTML also supports attributes, which are used to provide additional information about an element. Attributes are included within the opening tag of an element and can be used to specify things like the color of text or the size of an image.\n\nHTML documents can be created using a simple text editor, such as Notepad, and can be viewed in any web browser. As HTML is a client-side language, it is interpreted by the browser and displayed to the user.\n\nHTML is a foundational language for web development and is often used in conjunction with other languages, such as CSS (Cascading Style Sheets) and JavaScript, to create dynamic and interactive web pages."
    },
    {
      "id": "2",
      "title": "HTML Tags",
      "description": "HTML (Hypertext Markup Language) is the standard markup language used to create web pages. Here are some of the most commonly used HTML tags:\n\n<html>: This tag is used to indicate the beginning and end of an HTML document.\n\n<head>: This tag is used to contain the metadata of a web page, such as the title, keywords, and description.\n\n<title>: This tag is used to define the title of a web page. The title appears in the browser's title bar.\n\n<body>: This tag is used to contain the visible content of a web page.\n\n<h1> to <h6>: These tags are used to define headings of different sizes. <h1> is the largest heading and <h6> is the smallest.\n\n<p>: This tag is used to define a paragraph.\n\n<a>: This tag is used to create a hyperlink. The href attribute is used to specify the URL of the link.\n\n<img>: This tag is used to insert an image into a web page. The src attribute is used to specify the location of the image.\n\n<ul> and <li>: These tags are used to create an unordered list. <ul> is used to define the list, and <li> is used to define each item in the list.\n\n<ol> and <li>: These tags are used to create an ordered list. <ol> is used to define the list, and <li> is used to define each item in the list.\n\n<table>, <tr>, <td>, and <th>: These tags are used to create tables. <table> is used to define the table, <tr> is used to define each row, <td> is used to define each cell in the row, and <th> is used to define the header cell in a row or column.\n\n<form>, <input>, and <button>: These tags are used to create forms. <form> is used to define the form, <input> is used to define form elements such as text boxes, radio buttons, and checkboxes, and <button> is used to define a button that can be clicked to submit the form.\n\n<div>: This tag is used to define a section or division of a web page. It can be used to group related elements together, and can also be styled with CSS.\n\n<span>: This tag is similar to <div>, but it is used to group inline elements together.\n\n<header>: This tag is used to define the header of a web page or a section within a page.\n\n<footer>: This tag is used to define the footer of a web page or a section within a page.\n\n<nav>: This tag is used to define a section of a web page that contains navigation links.\n\n<section>: This tag is used to define a section of a web page that is semantically distinct from other content on the page.\n\n<article>: This tag is used to define a self-contained article or blog post on a web page.\n\n<aside>: This tag is used to define content that is related to the main content on a web page, but is not essential to understanding the main content.\n\n<blockquote>: This tag is used to define a block of quoted text.\n\n<cite>: This tag is used to define the title of a work that is being cited, such as a book, article, or movie.\n\n<code>: This tag is used to define a block of code or a code snippet.\n\n<pre>: This tag is used to define preformatted text, which preserves white space and line breaks.\n\n<strong> and <em>: These tags are used to define text that should be emphasized. <strong> is typically used for text that should be strongly emphasized, while <em> is typically used for text that should be subtly emphasized.\n\n<br>: This tag is used to insert a line break within a block of text.\n\n<hr>: This tag is used to insert a horizontal line into a web page.\n\n<audio>: This tag is used to embed audio content into a web page. The src attribute is used to specify the URL of the audio file.\n\n<video>: This tag is used to embed video content into a web page. The src attribute is used to specify the URL of the video file.\n\n<source>: This tag is used to specify multiple versions of the same media file, such as different video formats or bitrates, and let the browser choose the appropriate version based on the user's device and connection.\n\n<iframe>: This tag is used to embed another web page or document within the current web page. The src attribute is used to specify the URL of the page to be embedded.\n\n<script>: This tag is used to define JavaScript code that should be executed within the web page. The src attribute can be used to specify an external JavaScript file.\n\n<noscript>: This tag is used to define content that should be displayed if the user's browser does not support JavaScript, or if JavaScript has been disabled.\n\n<meta>: This tag is used to define metadata about the web page, such as the character encoding, keywords, and description.\n\n<label>: This tag is used to associate a label with a form element, such as a text box or radio button. This makes it easier for users to understand what each form element represents.\n\n<select> and <option>: These tags are used to create drop-down menus and list boxes within a form. <select> is used to define the list, and <option> is used to define each item in the list.\n\n<textarea>: This tag is used to create a multi-line text box within a form.\n\n<button>: This tag is used to create a button that can be clicked to perform an action within a form or elsewhere on the page.\n\n<progress>: This tag is used to display the progress of a task, such as the download of a large file or the completion of a form submission.\n\n<meter>: This tag is used to display a measurement within a range, such as the percentage of a battery's charge remaining.\n\n<datalist> and <option>: These tags are used to create a list of predefined options that can be selected within a form. <datalist> is used to define the list, and <option> is used to define each item in the list."
    },
    {
      "id": "3",
      "title": "Document Structure",
      "description": "The basic structure of an HTML document includes the following components:\n\n<code>\n<!DOCTYPE html>\n<html>\n  <head>\n    <meta charset=\"UTF-8\">\n    <title>Document Title</title>\n    <!-- Additional metadata, such as stylesheets and scripts, can be included here -->\n  </head>\n  <body>\n    <!-- The main content of the document is placed here -->\n  </body>\n</html>\n</code>\n\nThe <!DOCTYPE html> declaration tells the browser that the document is an HTML5 document.\n\nThe <html> element is the root element of the document and contains all other elements.\n\nThe <head> element contains metadata about the document, such as the character set, title, and links to stylesheets and scripts.\n\nThe <meta> element sets the character encoding of the document to UTF-8, which supports all characters from all languages and alphabets.\n\nThe <title> element sets the title of the document, which is displayed in the browser's title bar and can be used by search engines to display search results.\n\nThe <body> element contains the main content of the document, such as text, images, videos, and other HTML elements.\n\nAdditional elements can be added to the document structure to organize and format the content, such as headings, paragraphs, lists, and tables."
    }
  ]
}