[
    {
        "id": "1",
        "imgsrc_fr": "assets/images/prabhupadaBooks/bg_fr.jpg",
        "imgsrc_bc": "assets/images/prabhupadaBooks/bg_bc.jpg",
        "bname": "ஸ்ரீமத் பகவத் கீதை - உண்மையுருவில் ",
        "detail": "உலகிலேயே மிகவும் பிரசித்தி பெற்ற பகவத் கீதை வேத ஞானத்தின் மணிமகுடமாக உலகம் முழுவதும் உணரப்படும் பகவத் கீதை, முழுமுதற் கடவுளான ஸ்ரீ கிருஷ்ணரால் அவரது நெருங்கிய பக்தரான அர்ஜுனனுக்கு உபதேசிக்கப்பட்டது. கீதையின் எழுநூறு ஸ்லோகங்களும் மனித சமுதாயத்தின் ஆன்மீக முன்னேற்றத்திற்கு மிகச்சிறந்த வழிகாட்டியாக விளங்குகின்றன. ஆன்மீக விஞ்ஞானத்தை அறிவதில் கீதைக்கு இணை வேறெதுவும் இல்லை என்றால் அது மிகையாகாது. இந்த வெளியீட்டின் தனிச்சிறப்பு அகில உலக கிருஷ்ண பக்தி இயக்கத்தின் ஸ்தாபக ஆச்சாரியாரும், உலகின் தலைசிறந்த வேத பண்டிதருமான தெய்வத்திரு அ.ச.பக்திவேதாந்த சுவாமி பிரபுபாதர், இந்நூலில் பகவான் ஸ்ரீ கிருஷ்ணரிடம் இருந்து தொடங்கிய ஆச்சாரிய பரம்பரையில் பெறப்பட்ட ஞானத்தை அப்படியே வழங்குகின்றார். பகவத் கீதைக்கு பலர் விளக்கவுரை வழங்கியுள்ளனர். ஆனால் அந்நூல்களால் ஒரே ஒரு மனிதனைக்கூட பூரண கிருஷ்ண பக்தனாக்க இயலவில்லை . இருப்பினும் ஸ்ரீல பிரபுபாதரின் இந்நூல், பார் முழுவதும் கிருஷ்ண பக்தியைப் பரவச்செய்துள்ளது. முழுமுதற் கடவுளான பகவான் ஸ்ரீ கிருஷ்ணர் எவ்வாறு உபதேசித்தாரோ, அர்ஜுனன் எவ்வாறு புரிந்து கொண்டானோ, அவ்வாறே உள்ளது உள்ளபடி, கீதையின் பொருளைச் சிதைக்காமல், ஸ்ரீல பிரபுபாதர் விளக்கமளித்துள்ளதே இதற்கு காரணம். இந்நூல் உலகெங்கிலும் பல்வேறு மொழிகளில் மொழிபெயர்க்கப்பட்டு, வேத ஞானம், தத்துவம், பண்பாடு ஆகியவற்றில் மாபெரும் சீர்திருத்தத்தை ஏற்படுத்தியுள்ளது."
    },
    {
        "id": "2",
        "imgsrc_fr": "assets/images/prabhupadaBooks/beyong-front.jpg",
        "imgsrc_bc": "assets/images/prabhupadaBooks/beyond-back.jpg",
        "bname": "பிறப்பிற்கும் இறப்பிற்கும் அப்பால் ",
        "detail": "மரணத்திற்குப் பின் வாழ்வு உண்டா? பிரபஞ்சத்தைத் தாண்டிய ஆத்மாவின் பயணத்தை அறிந்துகொள்ள வாரீர். இந்தியாவின் வேத அதிகாரிகளில் தலைசிறந்தவரான ஸ்ரீல பிரபுபாதர், மரணத்திற்குப் பின்பு ஆத்மா மேற்கொள்ளும் நம்பவியலாத பயணத்தினை ஆச்சரியத்தக்க ஆதாரங்களுடன் வெளியிடுகிறார். மேலும், ஆத்மா எவ்வாறு ஓர் உடலில் இருந்து மற்றோர் உடலிற்கு பயணம் செய்கிறது என்பதையும், உன்னத இருப்பிடத்தை அடைவதன் மூலமாக எவ்வாறு பிறப்பு இறப்பு சுழற்சியினை முடிவிற்கு கொண்டு வர முடியும் என்பதையும் அவர் விளக்குகிறார்."
    },
    {
        "id": "3",
        "imgsrc_fr": "assets/images/prabhupadaBooks/bs-front.jpg",
        "imgsrc_bc": "assets/images/prabhupadaBooks/bs-back.jpg",
        "bname": "ஸ்ரீ பிரம்ம ஸம்ஹிதை ",
        "detail": "புருஷோத்தமரான முழுமுதற் கடவுள் ஸ்ரீ கிருஷ்ணர் பிரம்மதேவருக்கு அறிவொளி வழங்குவதிலிருந்து பிரம்ம ஸம்ஹிதை தொடங்குகின்றது. அதனைத் தொடர்ந்து, இறைவனின் ஆன்மீக உலகம், பௌதிகத் தோற்றம், கிருஷ்ணர் மற்றும் அவரது சகாக்களின் குணங்கள் ஆகியவற்றை தனது இனிமையும் அழகும் நிறைந்த அற்புதமான பிரார்த்தனைகளின் மூலமாக பிரம்மதேவர் விளக்குகின்றார். பிரம்ம ஸம்ஹிதையின் இப்பதிப்பு, இஸ்கானின் ஸ்தாபக ஆச்சாரியரான ஸ்ரீல பிரபுபாதரின் குருவான ஸ்ரீல பக்திசித்தாந்த சரஸ்வதி தாகூரால் மொழிபெயர்க்கப்பட்டு விளக்கமளிக்கப்பட்டதாகும்."
    },
    {
        "id": "4",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\challenge_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\challenge_bc.jpg",
        "bname": "ஹரே கிருஷ்ணா சவால் ",
        "detail": "இது குறிப்பிட்ட எந்த மதத்திற்குமான பிரசார புத்தகமல்ல இப்புத்தகம் யதார்த்தமான, சிக்கலான பிரச்சனைகளுக்கு தீர்வு அளிக்கக்கூடிய, ஒளிவு மறைவற்ற, தவறுகளற்ற, தர்க்க சாஸ்திரத்தைக் கொண்டு மனதை ஊடுருவி விழிப்பூட்டக் கூடிய, முக்கியமான, ஆழ்ந்த கருத்துகளைக் கொண்டதாகும். இப்புத்தகத்தின் ஆசிரியரான, தெய்வத்திரு அ.ச. பக்திவேதாந்த சுவாமி பிரபுபாதர் வேத ஞானத்தில் பாண்டித்துவம் பெற்ற இந்நானளய வல்லுநர்களில் தலைசிறந்த ஒருவர். இப்புத்தகத்தில் தாங்கள் காண்பவை: • மறுபிறவி • உடலுறவும் துன்பமும் • பசுவதை • எளிய வாழ்வும் உயர்ந்து சிந்தனையும் • ஆன்மாவிற்கு விஞ்ஞானபூர்வமான அத்தாட்சி • மற்றும் பல…..!"
    },
    {
        "id": "5",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\civil_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\civil_bc.jpg",
        "bname": "ஆன்மீக வாழ்க்கை ",
        "detail": "“போலியான இன்றைய நாகரிகம் நாய்களின் பந்தயத்தைப் போன்றது. நாய் நான்கு கால்களில் ஓடுகிறது, நவீன மக்கள் நான்கு சக்கரங்களில் ஓடுகிறார்கள். அவ்வளவு தான்…. கல்வி கற்று புத்திக்கூர்மையுடன் இருப்பவன் தனது தற்போதைய வாழ்வை எண்ணிலடங்காத பூர்வீக வாழ்வில் தவறவிட்டதை அடைவதற்காக உபயோகிப்பான்; அதாவது தன்னுணர்விற்காகவும் இறையுணர்விற்காகவும் உபயோகிப்பான்.”"
    },
    {
        "id": "6",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\dharma_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\dharma_bc.jpg",
        "bname": "தர்மம் ",
        "detail": "தர்மம் தெய்வீக நிலையை அடைவதற்கான வழி “நான் யார்? என்னுடைய வாழ்வின் உண்மையான தேவைகள் என்ன? அத்தேவைகளை எவ்வாறு அடைவது?”-சிந்திக்கும் திறன் கொண்ட மனிதர்களால் அடிக்கடி கேட்கப்படும் இதுபோன்ற முக்கிய கேள்விகளுக்கு தர்மம் என்னும் இப்புத்தகம் பதிலளிக்கின்றது. “ஒரு பறவையைக் கூண்டில் வைத்து வளர்ப்பதாக எடுத்துக் கொள்வோம். அப்பறவைக்கு உணவளிக்காமல், கூண்டினை மட்டும் மெருகேற்றி வைத்தால், அப்பறவை ஒருபோதும் மகிழ்ச்சியடைய முடியாது. அதுபோலவே, இந்த ஜடவுடலானது ஆத்மாவின் கூண்டைப் போன்றது; நாம் உடலை மட்டும் பராமரித்து வந்தால், ஆத்மாவினால் ஒருபோதும் மகிழ்ச்சியடைய முடியாது. ஆத்மாவானது உடலினாலும் மனதினாலும் மூடப்பட்டுள்ளது; உடல் சம்பந்தப்பட்ட சௌகரியங்கள் மட்டுமின்றி மனத் திருப்தியும்கூட ஆத்மாவிற்கு ஒருபோதும் மகிழ்ச்சியைத் தர இயலாது,” என்று ஸ்ரீல பிரபுபாதர் உரைக்கின்றார். ஆத்மாவின் உண்மையான மகிழ்ச்சி என்ன என்பதையும், அதை எவ்வாறு அடைவது என்பதையும் அறிந்துகொள்ள தர்மம் என்னும் இப்புத்தகத்தை படியுங்கள்."
    },
    {
        "id": "7",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\gift_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\gift_bc.jpg",
        "bname": "கிருஷ்ண உணர்வு - ஈடு இணையற்ற வரம் ",
        "detail": "உலகில் எவ்வளவு பணம் கொடுத்தாலும் ஆன்மீக விடுதலையை அடைய முடியாது. இருப்பினும், இது மிகவும் அரிதான, மிகவும் உண்மை மற்றும் மிகவும் விரும்பத்தக்க விஷயம். மேலும் இது பணக்காரர்கள் மற்றும் ஏழைகள் இருவருக்கும் சமமாக உள்ளது. கிடைக்கும். உங்கள் வாழ்க்கையில் இந்த பரிசு வேண்டுமா? இதை அடைய தேவையான வரிசை முறை இங்கே. ஒன்றன் பின் ஒன்றாகச் செல்லுங்கள், நீங்கள் ஒரு தனித்துவமான பரிசைப் பெற்றிருப்பதைக் காண்பீர்கள், அது பொருள் துன்பங்களிலிருந்து நிரந்தர விடுதலையாகும்."
    },
    {
        "id": "8",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\gita-saar-fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\gita-saar-back.jpg",
        "bname": "கீதா சாரம் ",
        "detail": "பகவத் கீதை இந்தியாவின் ஆன்மீகப் பொக்கிஷங்களில் தலை சிறந்ததாகும். அகில உலக கிருஷ்ண பக்தி இயக்கத்தின் ஸ்தாபக ஆச்சாரியரான தெய்வத்திரு அ. ச. பக்திவேதாந்த சுவாமி பிரபுபாதர், இயக்கத்தினைத் தொடங்கிய ஆரம்ப காலத்தில், அதாவது 1967இல் பகவத் கீதையினை ஆங்கிலத்தில் மொழிபெயர்த்து அதன் ஒவ்வொரு ஸ்லோகத்திற்கும் தெளிவான விளக்கவுரையினை வழங்கினார். ஆனால் அச்சமயத்தில் அவரால் அதனை அச்சிட இயலாத காரணத்தினால், அவர் தனது பகவத் கீதை உரைக்காக எழுதிய அறிமுகத்தினை தனியாக ஒரு சிறு புத்தகத்தின் வடிவில் வெளியிட்டார். அந்த அறிமுகத்தின் தமிழ் பதிப்பே இந்த கீதாசாரம். இதனைப் படிப்பவர்கள் பகவத் கீதையின் தத்துவக் கருத்துகளை மிகவும் தெளிவாகவும் ஒளிவுமறைவின்றியும் அறிந்துகொள்வர். பகவத் கீதையினை முதன் முறையாக அணுகுவோருக்கு இந்த அறிமுகம் (கீதாசாரம்) மிகவும் உதவியாக அமையும். கீதையின் உண்மையான கருத்துகளை ஒதுக்கிவிட்டு எழுதப்பட்டுள்ள உரைகளும் கீதாசாரங்களும் ஏராளமானவை இருக்க, ஸ்ரீல பரபுபாதரின் பகவத் கீதை உரையானது, உள்ளது உள்ளபடி பந்தவொரு சொந்த கற்பனைகளும் வியாக்கியானங்களும் இன்றி கொடுக்கப்பட்டுள்ளது. கீதையில் கிருஷ்ணர் உண்மையில் என்ன உறுகின்றாரோ, அதில் ஸ்ரீல பிரபுபாதர் நமது கவனத்தினை – நறுத்துகிறார். எனவே, இந்த கீதாசாரம தங்கள் அறிவொளியை வழங்கி தனிப்பட்ட வாழ்வில் ஏற்படுத்தும் என்று நம்புகிறோம்."
    },
    {
        "id": "9",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\ishopanishad_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\ishopanishad_bc.jpg",
        "bname": "வேதம் வழங்கும் அறிவு (ஈசோபநிஷத் )",
        "detail": "வேத அறிவின் சாரமாக இருக்கும் 108 உபநிஷதங்களில், ஈஷோபநிஷத் முதன்மையானதாகத் திகழ்கிறது. அறிவொளி தரும் இந்த 18 மந்திரங்களில் எல்லா அறிவின் தூய்மையான சாரத்தைக் காண முடியும். ஆன்மீக ஆர்வமுடையோர் நுண்ணிய தத்துவம் நிரம்பிய உபநிஷதங்களை ஆயிரக்கணக்கான ஆண்டுகளாக அணுகி வந்துள்ளனர். உபநிஷத் என்றால் (உப-அருகில்; நி-கீழே; ஷத்-அமர்தல்) குருவிற்கு அருகில் அமர்ந்து கற்க வேண்டியது என்று பொருள். எந்த ஞானத்தைக் கற்க வேண்டும்? அதுகுறித்த தகவலை இந்த உபநிஷத் வழங்குகிறது: ஈஷ எனப்படும் பரம ஆளுநரைப் பற்றிக் கற்க வேண்டும். பரம ஆளுநராகத் திகழும் முழுமுதற் கடவுளை ஆன்மீக குருவிற்கு அருகில் அமர்ந்து அறிவோம், வாரீர்! அங்கீகாரம் பெற்ற குருவை அணுகும்போது, இந்த வழிமுறை எளிமையானதாகிறது."
    },
    {
        "id": "10",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\kapila_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\kapila_bc.jpg",
        "bname": "கபிலரின் யோகமுறை ",
        "detail": "பன்நெடுங் காலத்திற்கு முன்பு, பாரதத்தின் புராணங்களில் காணப்படும் யுகத்தில், புனிதத் தன்மைகள் நிறைந்த தேவஹூதியின் கருவிலிருந்து மாமுனிவரான கபிலர் இப்பூமியில் தோன்றினார். ஆன்மீக வாழ்வின் பக்குவத்தை நாடி தனது கணவர் வீட்டை விட்டுச் சென்றபோது, தேவஹூதி தனது தெய்வீகத் திருமகனான கபிலரிடம் ஆன்மீக ஞானத்தை நல்கும்படி வேண்டினாள். பின்னர், ஜடவுலகம், ஆத்மா, அனைத்திற்கும் இறுதி மூலம் ஆகியவற்றை நன்கு புரிந்துகொள்வதற்கான ஸாங்கியப் பாதையை கபிலர் அவளுக்குக் காட்டினார்."
    },
    {
        "id": "11",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\krishna_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\krishna_bc.jpg",
        "bname": "கிருஷ்ணா  - புருஷோத்தமராகிய முழுமுதற்கடவுள்  ",
        "detail": "மேல் நாட்டில் யாரேனும் கிருஷ்ணரைப் பற்றி கேள்விப்பட்டதில்லை என்பது பெரும் ஆச்சரியம். போ ஒவ்வொரு கலாசாரத்திலும் அவரவர் போற்றிப் பேணும் பழங்கதைகளும், வீரதீரர்களும், தேவதூதர்களும், கடவுளரும் உள்ளனர். ஆனால், கிருஷ்ணர் நம் சிற்றறிவுக்குட்பட்ட கலாசார வேறுபாடுகளையெல்லாம் கடந்து நிற்பவர். கிருஷ்ணரைப் பற்றிய அறிவு கலாசார எல்லைகளுக்கு அப்பாற்பட்டது, பரமானது, எல்லாவற்றையும் உள்ளடக்கியது, எல்லாவற்றையும் ஆகர்ஷிக்கவல்லது. கிருஷ்ணர் என்பவர் இந்து சமய வரலாற்றைச் சார்ந்த ஒரு கவி அல்லது மதவாதியின் வளமிக்க கற்பனையில் உதித்த ஒரு தோற்றமல்லர். மாறாக கிருஷ்ணர் பரம சத்தியமானவர், காரணங்களுக்கெல்லாம் காரணமானவர், எல்லாவற்றிற்கும் மேலாக பரம் பொருளான புருஷோத்தமன்."
    },
    {
        "id": "12",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\krishna_way_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\krishna_way_bc.jpg",
        "bname": "கிருஷ்ணருக்கான வழியில் ",
        "detail": "நாம் அனைவரும் மகிழ்ச்சியைத் தேடுகிறோம். ஆயினும், உண்மையான மகிழ்ச்சி நித்தியமான தளத்தில் உள்ளது என்பதை நம்மில் வெகு சிலரே அறிவர். இந்த தற்காலிக பௌதிக உடலைக் கொண்டு மகிழ்ச்சியைப் பெற முயல்வதால், நாம் விரக்தியடைகிறோம். ஆத்மா நித்தியமானது, முழுமுதற் கடவுளும் நித்தியமானவர்; எனவே, அவர்களுக்கு இடையிலான அன்புப் பரிமாற்றமும் நித்தியமானது. கிருஷ்ண உணர்வின் மூலமாக ஆன்மீக முன்னேற்றத்தைப் பெறும்போது, நம்மால் அந்த ஆன்மீக மகிழ்ச்சியை அனுபவிக்க முடியும்."
    },
    {
        "id": "13",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\kunthi_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\kunthi_bc.jpg",
        "bname": "குந்தி தேவியின் போதனைகள் ",
        "detail": "துக்கத்தையும் தைரியத்தையும் தனதாக்கிய குந்தி மகாராணி, சிறப்புமிக்க பண்டைய பாரத வரலாற்றில் முக்கியப் பங்கு வகிக்கின்றாள். பாரதத் தின் அரியணைக்காக நிகழ்ந்த கொடூரமான போருக்கு காரணமாக இருந்த அரசியல் நாடகத்தில் இவள் மையமாகத் திகழ்ந்தாள். பல்வேறு துன்பங்களுக்கு மத்தியிலும், தனது ஆன்மீக ஞானத்தினாலும் பலத்தினாலும் தனது மக்களை அவள் முறையாக வழிநடத்திச் சென்றாள். புனிதத் தன்மைகள் பொருந்திய மிகச்சிறந்த ஆத்மாவானகுந்திதேவியின் எளிமையானபோதனைகள், ஆழமான தெய்வீக உணர்ச்சிகளையும் தத்துவங்களையும் வெளிப்படுத்துகின்றன. அவை ஆன்மீக அறிஞர்களின் அறிவைத் துளைக்கக்கூடியவை. அக்கருத்துகள், வேதப் பண்பாட்டிலும் தத்துவத்திலும் உலகப் பிரசித்தி பெற்றவரான தெய்வத்திரு. அ.ச. பக்திவேதாந்த சுவாமி பிரபுபாதர் அவர்களால், குந்தி மகாராணியின் போதனைகள் என்னும் இப்புத்தகத் தின் மிகவும் தெளிவான முறையில் சக்தியுடன் வழங்கப்பட்டுள்ளன."
    },
    {
        "id": "14",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\law_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\law_bc.jpg",
        "bname": "இயற்கையின் சட்டங்கள் ",
        "detail": "ஒவ்வொரு செயலுக்கும் சமமான எதிர்விளைவுகள் உண்டு ஏழை, பணக்காரன், அறிவாளி, முட்டாள், உயர் ஜாதி. தாழ்ந்த ஜாதி போன்ற வேற்றுமைகள் இருப்பது ஏன்? இவற்றைக் கட்டுப்படுத்து பவர் யார்? இயற்கையின் சட்டங்கள் என்னும் இப்புத்தகத்தில், வேத ஞானத்தின் சிறப்பு வாய்ந்த சாஸ்திரங்களான ஸ்ரீ ஈஷோபநிஷத் மற்றும் ஸ்ரீமத் பாகவதத்தின் அடிப்படையில் இக்கேள்விகளுக்கு பதில் வழங்கப்பட்டுள்ளது. கர்மா, மறுபிறவி, முக்தி போன்றவற்றைப் பற்றிய இரகசியங்களையும் இயற்கையின் சட்டங்கள் விளக்குகின்றது. இவை மட்டுமின்றி, கர்ம பந்தத்தினை உடைத்தெறிந்து, பூரணமான விடுதலை. மகிழ்ச்சி, மற்றும் ஆன்மீக பக்குவநிலையை அடைவதற்கான யோகம் மற்றும் தியான வழிமுறையினையும் இப்புத்தகம் நமக்குக் காட்டுகின்றது."
    },
    {
        "id": "15",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\naradha_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\naradha_bc.jpg",
        "bname": "நாரத பக்தி சூத்ரம் ",
        "detail": "கடவுளிடம் அன்பு செலுத்தக் கற்றுக்கொள்ளும்போது மட்டுமே பக்குவமான, தூய, நிரந்தர அன்பை நம்மால் அடைய முடியும் என்று கிழக்கிலும் மேற்கிலும் உதித்த எண்ணற்ற உயர்ந்த நபர்கள் காலங்காலமாக நமக்கு எடுத்துரைத்து உள்ளனர். கடவுளிடம் அன்பு செலுத்தும் அக்கலையை பக்தி யோகம் கற்றுத் தருகின்றது. அதற்கு மாமுனிவரான நாரதரைத் தவிர வேறு சிறந்த ஆசிரியரும் உண்டோ ! நாரத பக்தி சூத்திரம் என்று அறியப்படும் இரத்தினம் போன்ற நாரதரின் எண்பத்திநான்கு பக்தி சூத்திரங்கள், இறைவனிடம் அன்பு செலுத்துவது குறித்த இரகசியங்களை வெளிப்படுத்துகின்றன. இறையன்பு என்றால் என்ன, இறையன்பு அல்லாதது எது; அதன் விளைவுகள் யாவை) இப்பாதையில் நமது முன்னேற்றத்திற்கு உதவக்கூடியவை யாவை, தடையாக இருக்கக்கூடியவை யாவை; மற்றும் பல இரகசியங்களை இச்சூத்திரங்கள் நமக்கு வழங்குகின்றன. வாழ்வின் இறுதிக் குறிக்கோளைத் தேடுவதில் தீவிரமாக இருப்பவருக்கு, நாரத பக்தி-சூத்திரம் அவசியமானதாகும்."
    },
    {
        "id": "16",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\peace_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\peace_bc.jpg",
        "bname": "அமைதியான வாழ்வுக்கு வழி ",
        "detail": "அமைதியான வாழ்வை அடைவது கடினமல்ல; இறைவனை உணர்வதால் அடையப்படும் அமைதியான வாழ்வே நமது உண்மையான நிலையாகும். உலகெங்கிலும் வேத அறிவைப் பரப்பிய மாபெரும் ஆச்சாரியரான ஸ்ரீல பிரபுபாதர், நமது தற்போதைய வாழ்வின் உண்மை நிலையையும் முழுமுதற் கடவுள் கிருஷ்ணரின் உறவில் அடையப்படும் உயர்ந்த நிலையையும் இந்நூலில் நமக்கு எடுத்துரைத்துள்ளார். இங்கே கூறப்பட்டுள்ள கிருஷ்ண உணர்வு நடைமுறைக்கு உகந்த பாதையாகும், இதனால் அளவற்ற ஆனந்தத்தை எளிதில் அடைய முடியும்."
    },
    {
        "id": "17",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\perfection_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\perfection_bc.jpg",
        "bname": "பக்குவநிலைக்கான வழி",
        "detail": "பக்குவநிலைக்கான வழி என்னும் இந்நூல் சிந்தனையுடைய நவீன கால வாசகர்களுக்கான பெரும் வரப்பிரசாதமாகும். மனித சமுதாயம் தனது ஆன்மீக வளர்ச்சிக்காக பன்னெடுங்காலமாகப் பின்பற்றி வரும் யோக வழிமுறைகளையும் அதுகுறித்த நுணுக்கமான – தத்துவங்களையும் இந்நூல் தெளிவாக விளக்குகின்றது. பகவத் கீதையின் அந்த யோக தத்துவத்தினை தெய்வத்திரு அ.ச. பக்திவேதாந்த சுவாமி பிரபுபாதர் (1896-1977) அழகாக எடுத்துரைத்துள்ளார். பகவத் கீதையின் தொடக்கத்தில், அர்ஜுனன், தன்னுடைய அடையாளத்தையும் குறிக்கோளையும் நினைத்து குழம்பியதால், கிருஷ்ணரிடம் சரணடைந்தான். கிருஷ்ணர் தமது திறன்மிக்க சீடனுக்கு பக்குவநிலைக்கான வழியை உபதேசித்தார். தனிப்பட்ட உணர்விற்கும் உன்னத உணர்விற்கும் இடையிலான இணைப்பே பக்தி யோகம் எனப்படுகிறது. இந்த பக்தி யோகப் பயிற்சியினை வாழ்வின் மையமாக நிலைநிறுத்த வேண்டும் என்பதே கீதையில் பகவான் கிருஷ்ணர் வழங்கும் உபதேசத்தின் சாரமாகும். பக்குவநிலைக்கான வழி என்னும் இந்நூலில், யோகத்தின் எல்லா வடிவங்களையும் உள்ளடக்கிய பக்தி யோகம் மிகவும் எளிமையானது, உலகெங்கிலும் பின்பற்றத்தக்கது என்பனவற்றை ஸ்ரீல பிரபுபாதர் தமது தொடர் சொற்பொழிவின் மூலமாக தெளிவாகவும் சுருக்கமாகவும் எடுத்துரைக்கின்றார். மிகவும் சிக்கலான நவீன நாகரிகத்தில் பிணைக்கப்பட்டுள்ள நபர்களும்கூட எவ்வாறு சிக்கலற்ற முறையில் மனதைத் தூய்மைப்படுத்திக் கொண்டு பரம ஆனந்தத்தை அனுபவிக்க முடியும் என்பதை ஸ்ரீல பிரபுபாதர் காண்பிக்கின்றார்."
    },
    {
        "id": "18",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\prabhupada_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\prabhupada_bc.jpg",
        "bname": "ஸ்ரீல பிரபுபாதா ",
        "detail": "ஸ்ரீல பிரபுபாதா என்று பிற்பாடு எல்லோராலும் அன்போடு அழைக்கப்பட்ட தெய்வத்திரு பக்தி வேதாந்த ஸ்வாமி அவர்களின் புகழ் அவர் 1965 ஆம் வருடம் அமெரிக்காவில் காலடி எடுத்து வைத்த பின்தான் உலகமெங்கும் பரவியது. இந்தியாவை விட்டு முதன் முதலில் கிளம்புவதற்கு முன் அவர் மூன்று புத்தகங்களை எழுதியிருந்தார். அடுத்து வந்த பன்னிரண்டு வருடங்களில் அவரால் எழுதப்பட்டவை அறுபதுக்கும் மேற்பட்ட புத்தகங்கள். இந்தியாவை விட்டு கிளம்புவதற்கு முன் அவருக்கு இருந்தது ஒரே ஒரு சிஷ்யரே. ஆனால் அடுத்த பன்னிரண்டு வருடங்களில் அவரிடம் தீட்சை பெற்றவர்களின் எண்ணிக்கை 4000-க்கும் மேல். இந்தியாவை விட்டு அவர் கிளம்புவதற்கு முன் அகில உலக கிருஷ்ண பக்தி கழகம் ஒன்றை ஏற்படுத்த வேண்டும் என்ற அவர் கனவு பலிக்கும் என்று யாரும் நம்பவில்லை. ஆனால் அடுத்த பத்தாண்டுகளில் ஒரு மாபெரும் சிந்தனை உணர்வு இயக்கத்தை உருவாக்கி விரிவாக்கி செயல்படுத்திக் காட்டினார். நூற்றுக்கும் மேற்பட்ட மையங்களை நிறுவினார். அமெரிக்காவுக்கு கப்பல் பயணம் மேற்கொள்வதற்கு முன் பிரபுபாதா இந்தியாவை விட்டு வெளியே எங்கேயும் சென்றதில்லை. ஆனால் அடுத்த 12 வருடங்களில் அவர் உலகத்தை பதினான்கு முறை கிருஷ்ணரைப் பற்றி பிரசாரம் செய்த வண்ணம் சுற்றிக் கொண்டிருந்தார். அவருடைய இந்த சாதனை ஏதோ திடீரென்று அவரது எழுபதாவது வயதில் வெடித்த ஆன்மீக புரட்சிபோல் தோற்றமளித்தாலும் அவர் இச்சாதனைக்கு அறுபத்து ஒன்பது ஆண்டுகளாக தன்னை தயார்படுத்திக் கொண்டு வந்துள்ளார். அமெரிக்கர்களுக்கு பிரபுபாதாவும் அவருடைய போதனைகளும் வானத்திலிருந்து திடீரென குதித்தது போல் தோற்றமளித்தாலும் (அவரைப் பற்றி சொல்லும் போது அமெரிக்கர்கள் ‘அலாவுதீன் விளக்கிலிருந்து தோன்றினார்’ என்று குறிப்பிட்டனர்) உண்மையில் அவர் மிகவும் தொன்மை வாய்ந்த கலாச்சார தலைமுறை வழக்கங்களின் மலை போன்ற துணிகரமான பிரதிநிதி."
    },
    {
        "id": "19",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\prahalada_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\prahalada_bc.jpg",
        "bname": "பிரஹலாதரின் திவ்ய உபதேசங்கள் ",
        "detail": "ஐந்து வயதே நிரம்பிய சிறுவனான பிரகலாத மஹாராஜர் தனது நாத்திக தந்தையான ஹிரண்யகசிபுவின் தொந்தரவுகளுக்கு மத்தியிலும் சக பள்ளி மாணவர்களிடம் தன்னுணர்வு குறித்த தெய்வீக விஞ்ஞானத்தை போதிக்கின்றார். அந்த தெய்வீக ஞானத்தை, அவர் தனது தாயின் கருவில் இருந்தபோது, தனது ஆன்மீக குருவான நாரத முனிவரிடமிருந்து பெற்றார். இச்சிறிய புத்தகத்தினுள் தொகுக்கப்பட்டுள்ள அந்த அற்புதமான போதனைகள், தியானம், புலன் கட்டுப்பாடு, மன அமைதியைப் பெறுதல் போன்றவை மட்டுமின்றி, வாழ்வின் உயர்ந்த குறிக்கோளான கடவுளின் மீதான தூய அன்பினை அடைவதற்கும் நமக்கு கற்றுத் தருகிறது."
    },
    {
        "id": "20",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\question_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\question_bc.jpg",
        "bname": "பக்குவமான கேள்விகளும் பக்குவமான பதில்களும் ",
        "detail": "அமெரிக்காவின் அமைதிப் படையில் பணியாற்றி வந்த பாப் கோஹென் என்பவர் 1972இல் ஆன்மீக அறிவினைத் தேடி மேற்கு வங்காளத்திலுள்ள மாயாபுர் எனப்படும் புராதன பூமிக்கு வந்தார். அந்த புனித பூமியில், ஓர் எளிய குடிசையினுள் இந்தியாவின் மிகச்சிறந்த ஆச்சாரியரின் திருவடிகளில் அவர் தஞ்சமடைந்தார். அவர் என்னவெல்லாம் அறிய விரும்பினாரோ, அவையனைத்தையும் அந்த ஆச்சாரியர் அவருக்குக் கற்றுக் கொடுத்தார்."
    },
    {
        "id": "21",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\raja-vidya-fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\raja-vidya-back.jpg",
        "bname": "அறிவின் அரசன் ",
        "detail": "அறிவின் அரசன் எல்லா அறிவைக் காட்டிலும் தலைசிறந்த அறிவு எது என்பது உங்களுக்கு தெரியுமா? தெய்வீக விஷயங்கள் குறித்து அறிவதில் நீங்கள் ஆர்வமுடையவராக இருப்பின், அதற்கான விடையை இப்புத்தகத்திலிருந்து பெறலாம். எல்லா இரகசியங்களிலும் இரகசியமான விஷயத்தினுள் நுழையுங்கள், அறிவின் அரசனை உங்களது கையில் பிடியுங்கள்; மேலும், உங்களது மனதையும் இதயத்தையும் திறந்து இவ்வுலகத்திற்கு அப்பாற்பட்ட தகவல்களைப் பெறுங்கள்."
    },
    {
        "id": "22",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\ramayan_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\ramayan_bc.jpg",
        "bname": "வால்மீகி ராமாயணம் ",
        "detail": "வால்மீகி இராமாயணம் சுருக்க உரை: பூர்ணபிரக்ஞ தாஸ் முழுமுதற் கடவுளான பகவான் இராமசந்திரரின் லீலைகளை அற்புதமான வடிவில் வால்மீகி இராமாயணம் வழங்குகின்றது. பகவான் இராமரும் சீதையும், பல்வேறு துரதிர்ஷ்டங்கள், சஞ்சலங்கள், மற்றும் தடைகளைச் சந்தித்தனர்; இருப்பினும், பிறழாத மனதுடனும் உறுதியுடனும் தைரியத்துடனும் அவற்றைச் சந்தித்தனர். அவர்களுக்கு உதவியாக இருந்த காலத்திற்கு அப்பாற்பட்ட ஆன்மீக அறிவையும் தன்மையையும் இந்த பதிப்பு துல்லியமாக வெளிப்படுத்துகிறது; இதன் மூலமாக நாமும் நமது வாழ்வின் சவால்களையும் தடைகளையும் வெற்றிகொள்ளலாம்."
    },
    {
        "id": "23",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\rebirth-fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\rebirth_bc.jpg",
        "bname": "மறுபிறப்பு ",
        "detail": "இதுவரை எங்கும் காணப்படாத முழுமையான விளக்கங்கள் வாழ்க்கை பிறப்பில் தொடங்கி இறப்பில் முடியக்கூடியது அல்ல. ஆத்மா தனது தற்போதைய உடலை விட்டு வெளியேறும்போது, நடப்பது என்ன? அது மற்றோர் உடலை ஏற்கின்றதா? இதுபோன்ற மறுபிறவிகளுக்கு முடிவு உண்டா ? மறுபிறவி எதன் அடிப்படையில் நிகழ்கின்றது? நமது வருங்கால பிறவிகளை நம்மால் கட்டுப்படுத்த முடியுமா? மறுபிறவி என்னும் இந்நூல், இத்தகு ஆழமான கேள்விகள் எல்லாவற்றிற்கும் பதிலளிக்கின்றது; காலத்திற்கு அப்பாற்பட்ட அங்கீகரிக்கப்பட்ட சாஸ்திரங்களை அடிப்படையாகக் கொண்டு, மறுபிறவி குறித்த தெளிவான உண்மைகளையும் முழுமையான விளக்கங்களையும் இது வழங்குகின்றது."
    },
    {
        "id": "24",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\resorvior_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\resorvior_bc.jpg",
        "bname": "கிருஷ்ணர் - இன்பத்தின் இருப்பிடம் ",
        "detail": "எல்லோரும் பேரின்பத்தைத் தேடுகிறார்கள், ஆனால் கிருஷ்ணருடன் நாம் பெறும் மகிழ்ச்சியுடன் ஒப்பிடுகையில் மற்ற அனைத்தும் மங்கிவிடும். கிருஷ்ணரின் மயக்கும் ஆளுமை மற்றும் அவரது பொழுது போக்குகளைப் பற்றி அறிந்து, மகிழ்ச்சியின் மகத்தான செல்வத்தை அனுபவிக்கவும்."
    },
    {
        "id": "25",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\science.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\science_bc.jpg",
        "bname": "தன்னை அறியும் விஞ்ஞானம் ",
        "detail": "ஆழ்ந்த அறிவுடனும் உயர்ந்த ஆன்மீக உணர்வுடனும் உண்மையான சாதுவாகத் திகழ்ந்த ஸ்ரீல பிரபுபாதர் ஆன்மீகப் பஞ்சத்தில் தவிக்கும் சமுதாயத்தின் மீது மிகுந்த அக்கறையும் கருணையும் கொண்டிருந்தார். சிறந்த ஆத்ம ஞானிகளான ஆச்சாரியர்கள் பல்லாயிரம் ஆண்டுகளாக வழங்கி வரும் காலத்திற்கு அப்பாற்பட்ட உயர்ந்த ஞானத்தினை மனித சமுதாயத்திற்கு அறிவொளி வழங்கும் பொருட்டு, நவீன கால மக்களுக்காக அவர் வழங்குகிறார். அந்த மிகவுயர்ந்த அறிவு உடலினுள் இருக்கும் ஆத்மா, உலக இயற்கை, உள்ளும் புறமும் வீற்றிருக்கும் பரமாத்மா முதலிய இரகசியங்களை வெளிப்படுத்துகிறது. ஆர்வத்தைத் தூண்டும் இந்த நூலில், ஆத்ம ஆராய்ச்சி குறித்து புகழ்பெற்ற இதய அறுவை சிகிச்சை நிபுணருடனான ஸ்ரீல பிரபுபாதரின் கருத்து பரிமாற்றம், மறுபிறவியைப் பற்றி இலண்டன் வானொலி நிறுவனத்திற்கான அவரது பேட்டி, உண்மை மற்றும் போலி குருமார்களைப் பற்றி இலண்டன் டைம்ஸ் பத்திரிகையில் அவர் தெரிவித்த ஆணித்தரமான கருத்துகள், கிருஷ்ணர் மற்றும் கிறிஸ்துவைப் பற்றி ஜெர்மானிய பெனெடிக்டின் மத குருவிடம் அவர் மேற்கொண்ட உரையாடல், கர்ம விதிகள் குறித்த அவரது ஆழ்ந்த கண்ணோட்டம், ஆன்மீகப் பொதுவுடைமையைப் பற்றி ரஷ்யப் பேரறிஞர் ஒருவருடனான அவரது கலந்துரையாடல் என பல்வேறு கட்டுரைகள் இடம் பெற்றுள்ளன. தன்னையறியும் விஞ்ஞானம் என்னும் இந்நூல், நம்முள் இருக்கும் அறிவையும் உற்சாகத்தையும் தூண்டி, பரமாத்மாவின் தொண்டில் ஆத்மா இணைவதற்கு உதவும்."
    },
    {
        "id": "26",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\soul_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\soul_bc.jpg",
        "bname": "உயிரிலிருந்து உயிர் தோன்றுகிறது ",
        "detail": "நவீன விஞ்ஞானிகள் ஒவ்வொரு கூற்றையும் பரிசோதித்து நிரூபிக்கப்பட்ட உண்மையென ஒப்புக்கொள்வதை வழக்கமாக கொண்டுள்ள மக்களை இந்நூல் விழிப்படையச் செய்யும். “உயிர் உயிரிலிருந்து தோன்றுகிறது” (LIFE COMES FROM LIFE) எனும் இந்நூலில் இந்த நூற்றாண்டின் தலைசிறந்த தத்துவஞானிகள் மற்றும் அறிஞர்களுள் ஒருவரான தெய்வத்திரு. அ.ச. பக்திவேதாந்த சுவாமி பிரபுபாதர் அவர்கள், நவீன விஞ்ஞானமும் விஞ்ஞானிகளும் கொண்டுள்ள மேலோங்கிய கருத்துக்களையும், கோட்பாடுகளையும், நம்பிக்கைகளையும் மிகச்சிறந்த ஆனால் எளிய முறையில் விமர்சிக்கிறார். உயிரின் தோற்றுவாய் மற்றும் நோக்கத்தைப் பற்றி இன்று நிலவும் நாகரிகக் கொள்கைகளின் அடித்தளத்தில் மறைந்துள்ள முற்றிலும் ஆதாரமற்ற அனுமானங்களை ஸ்ரீல பிரபுபாதர் அவர்கள் தமது தெளிவான வாதங்கள் மூலம் தகர்க்கிறார். 1973-ல் லாஸ் ஏஞ்சல்ஸ் பகுதியில் ஸ்ரீல பிரபுபாதர் தம் காலை உலாக்களின் போது சீடர்கள் சிலருடன் நிகழ்த்திய உரையாடல்களின் அடிப்படையில் இந்நூல் அமைந்துள்ளது. (உரையாடல்கள் டேப்பில் பதிவு செய்யப்பட்டிருந்தன) விஞ்ஞானத்தை மையமாகக் கொண்ட உரையாடல்களின்போது ஸ்ரீல பிரபுபாதர் பெரும்பாலும் தம் சீடர் டாக்டர் தௌடம் டி.சிங்குடன் பேசினார். உயிர்ப்பொருள் ரசானியான டாக்டர் சிங் தற்போது பக்திவேதாந்தக் கழகத்தின் இயக்குநராகப் பணியாற்றுகிறார். இந்நிறுவனம் விஞ்ஞானம், தத்துவம், மத சாஸ்திரம் ஆகிய துறைகளில் முதுநிலை ஆராய்ச்சிகளை மேற்கொண்டுள்ள சர்வதேச மையமாக விளங்குகிறது."
    },
    {
        "id": "27",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\top-most-fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\top-most-bc.jpg",
        "bname": "மிக உன்னத யோகம் ",
        "detail": "பலவகையான யோகப் பயிற்சிகள் உள்ளன; ஆனால் நீங்கள் என்னதான் அவற்றை பயிற்சி செய்தாலும் அவற்றில் பக்தி இருந்தால் மட்டுமே வெற்றியடைய முடியும் என்று வேத இலக்கியங்கள் எடுத்துரைக்கின்றன. பக்தி யோகம் என்றால் என்ன, அதனை நீங்கள் எவ்வாறு உங்கள் வாழ்விலோ தற்போதைய யோகப் பயிற்சியிலோ இணைத்துக் கொள்வது? எல்லா யோகத்திற்கும் மதப் பழக்கத் திற்கும் முக்கியமான அங்கம் என்பதால், பக்தியே மிக உன்னத யோகமாக அறியப்படுகிறது. பகவத் கீதையில் கிருஷ்ணர் தனது நெருங்கிய நண்பனான அர்ஜுனனுக்கு பக்தி யோகத்தை விளக்கினார். அக்கருத்துகளை இங்கே இந்த சிறிய புத்தகத்தில் ஸ்ரீல பிரபுபாதர் மேலும் தெளிவுபடுத்துகிறார்."
    },
    {
        "id": "28",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\upadesh_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\upadesh_bc.jpg",
        "bname": "உபதேஷாம்ருதம் ",
        "detail": "மிகச்சிறந்த ஆன்மீகச் செம்மலாகத் திகழ்ந்த ஸ்ரீல ரூப கோஸ்வாமியினால், சுமார் ஜநூறு ஆண்டுகளுக்கு முன்பு உபதேசாம்ருதம்” என்னும் பெயரில் சமஸ்கிருதத்தில் எழுதப்பட்ட பதினொரு ஸ்லோகங்கள் ஆன்மீக ஞானத்தின் சாரமாகத் திகழ்கின்றன. குருவை எவ்வாறு தேர்ந்தெடுப்பது, யோகத்தை எவ்வாறு பயிற்சி செய்வது, எங்கு வாழ்வது போன்ற கேள்விகளுக்கான ஒப்பற்ற விளக்கங்களை இதில் காணலாம். ஸ்ரீல ரூப கோஸ்வாமியின் பரம்பரையில் வந்த நவீன கால ஆச்சாரியரான தெய்வத்திரு அ.க பக்திவேதாந்த சுவாமி பிரபுபாதரால் மொழிபெயர்க்கப்பட்டு மெருகூட்டப்பட்டுள்ள இப்புத்தகம், பக்குவமான ஆன்மீகப் பாதையைத் தேடுவோருக்கு ஒரு சிறந்த வழிகாட்டியாகும்."
    },
    {
        "id": "29",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\yoga-fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\yoga-back.jpg",
        "bname": "யோகம் ",
        "detail": "ஆத்ம யோகம் இமயமலையின் குகையினுள் ஒளிந்து கொண்டு யோகப் பயிற்சியில் பக்குவம் பெறலாம் என்று நீங்கள் நினைத்தால், சற்று நில்லுங்கள். ஆத்ம யோகம் என்னும் இந்நூலில், தெய்வீக மன்னரான ரிஷபதேவரால் தமது மகன்களுக்கு நீண்ட நெடுங்காலத்திற்கு முன்பு வழங்கப்பட்ட உபதேசங்களை அடிப்படையாகக் கொண்டு, இருபதாம் நூற்றாண்டின் தலைசிறந்த தத்துவஞானிகளில் ஒருவரான ஸ்ரீல பிரபுபாதர், யோகாசனத்திற்கும் பிராணாயாமத்திற்கும் அப்பாற்பட்ட உன்னத யோகத்தையும் என்றும் அதிகரிக்கும் அந்த தெய்வீக ஆனந்தத்தின் தளத்தினை எவ்வாறு அடைவது என்பதையும் நமக்குக் கற்றுத் தருகிறார்."
    },
    {
        "id": "30",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bakthiRas_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bakthiRas_bc.jpg",
        "bname": "பக்தி ரசாம்ருத சிந்து ",
        "detail": "பக்தி ரஸாம்ருத சிந்து பூரணமான பக்தி யோக விஞ்ஞானம் இந்த பக்தி ரஸ்ாம்ருத சிந்து என்பது ஸ்ரீல ரூப கோஸ்வாமியால் பக்தி என்னும் கடலிருந்து எடுக்கப்பட்ட அமிர்தத்தின் சுருக்கமான பாடமாகும். இது தெய்வீக சேவையின் மூலம் கடவுளுடன் தொடர்பு கொள்ளுதல் என்ற பக்தி யோகத்தின் முழுமையான விஞ்ஞானமாகும். கடவுள் உணர்வை அடையும் பாதையில் பக்தி யோகமே மிக உயர்ந்த பாதையாகும். இது எளிமையும், மேன்மையும் ஒன்று சேரப் பெற்றதாகும். இக்கலியுகத்தில் இது ஒவ்வொருவருக்கும் சிபாரிசு செய்யப்பட்டு இருக்கிறது."
    },
    {
        "id": "31",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham_bc.jpg",
        "bname": "ஸ்ரீமத் பாகவதம் ",
        "detail": "“இந்தப் பாகவத புராணம் சூரியனைப் போல பிரகாசமாக இருக்கிறது, பகவான் கிருஷ்ணர் ஸ்வதாமாவிற்குப் புறப்பட்ட உடனேயே உதயமானது. இந்தக் கலியுகத்தில், அடர்ந்த அறியாமையால் குருடர்களாக மாறியவர்கள் இந்தப் புராணத்திலிருந்து ஒளி பெறுவார்கள். ஆரம்பத்தில், இந்த அறிவு வாய்வழி பாரம்பரியத்தால் பாதுகாக்கப்பட்டது; ஆனால் ஐயாயிரம் ஆண்டுகளுக்கு முன்பு, கடவுளான ஸ்ரீல வியாசதேவரின் “இலக்கிய அவதாரம்” முதலில் வேதங்களை எழுத்து வடிவில் வழங்கியது. வேதங்களைத் தொகுத்த பிறகு, வேதங்களின் சாரத்தை “வேதாந்த சூத்திரங்கள்” வடிவில் வழங்கினார். ஸ்ரீமத்பாகவதம் (பாகவத புராணம்) என்பது வியாசதேவரால் இயற்றப்பட்ட வேதாந்த சூத்திரத்தின் விளக்கமாகும். அவர் தனது ஆன்மீக வாழ்க்கையின் முதிர்ந்த கட்டத்தில், தனது குரு ஸ்ரீ நாரத் முனியின் வழிகாட்டுதலின் கீழ் இதை எழுதினார். “வேத இலக்கியத்தின் கல்பவ்ரிக்ஷத்தின் பழுத்த பழம்” என்று புகழப்படும், இது ஸ்ரீமத்-பாகவதம் வேத அறிவின் மிகவும் முழுமையான மற்றும் தரப்படுத்தப்பட்ட விளக்கமாகும். ஸ்ரீமத்பாகவதை இயற்றிய பிறகு, வியாசதேவர் அதன் சாரத்தை தனது மகன் ஸ்ரீ சுகதேவ் கோஸ்வாமிக்கு தெரிவித்தார். அதன் பிறகு, ஹஸ்தினாபூரில் (இப்போது டெல்லி) நடந்த கங்காடாதி முனிவர்களின் கூட்டத்தில் பரீக்ஷித் மகாராஜின் முழு பகவத்தையும் சுகதேவ் கோஸ்வாமி கேட்டார். பரீக்ஷித் மகாராஜ் சக்ரவர்த்தி ஒரு பேரரசர் மற்றும் ஒரு சிறந்த ராஜரிஷி ஆவார். ஏழு நாட்களில் மாமா இறந்துவிடுவார் என்று எச்சரிக்கப்பட்ட நேரத்தில், அவர் தனது முழு ராஜ்யத்தையும் துறந்தார், ஆனால் சாகும்வரை உண்ணாவிரதம் இருந்தார், அதே போல் ஆன்மீக ஞானம் அடைய வேண்டும்."
    },
    {
        "id": "32",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham2.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham3.1.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "33",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham3.2.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham4.1.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "34",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham4.2.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham5.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "35",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham6.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham7.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "36",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham9.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham10.1.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "37",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham10.2.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham10.3.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "38",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bhagavatham10.4.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\bhagavatham12.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "39",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\ccfirst_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\ccfirst_bc.jpg",
        "bname": "சைதன்ய சரிதாம்ருதம் ",
        "detail": "ஸ்ரீ சைதன்ய மஹாபிரபு ஒரு சிறந்த தத்துவஞானி, துறவி, ஆன்மீக ஆசிரியர், யோகி மற்றும் பகவத்-பாதர் ஆவார். அவர் 16 ஆம் நூற்றாண்டில் இந்தியாவில் ஒரு பெரிய சமூக மற்றும் மத இயக்கத்தை நிறுவினார். ஸ்ரீ சைதன்ய-சரிதாமிருதம் அவரது வாழ்க்கை மற்றும் போதனைகள் பற்றிய அதிகாரப்பூர்வ ஆய்வு ஆகும். தத்துவஞானி மற்றும் அவரது போதனைகள், மத உண்மைகள் நிறைந்தவை, இன்றுவரை எண்ணற்ற தத்துவ மற்றும் மத சிந்தனையாளர்களை பாதித்துள்ளன. அசல் பெங்காலி கவிதைகளின் இந்த மொழிபெயர்ப்பு மற்றும் விளக்கம், உலகின் தனித்துவமான அறிஞரும் இந்திய சிந்தனை மற்றும் கலாச்சாரத்தின் ஆசிரியருமான சுவாமி பிரபுபாதா மற்றும் அதன் தொகுப்பாளரான கிருஷ்ணகிரிபாஸ்ரீமூர்த்தி அபய்சரண்விந்த் பக்திவேதாந்தா அவர்களால் வழங்கப்பட்டுள்ளது. ஸ்ரீ சைதன்ய சரிதாமிருதத்தின் இந்த மொழிபெயர்ப்பு இன்றைய மனிதனின் அறிவுசார், கலாச்சார மற்றும் ஆன்மீக வாழ்க்கையை வளப்படுத்த பெரும் உதவியாக இருக்கும்."
    },
    {
        "id": "40",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\ccfirst_2.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\ccfirst_bc.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "41",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\ccmadhya_fr.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\ccmadya.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "42",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\ccmadya_2.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\ccmadya_4.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "43",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\ccmadya5.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\ccmadyaone.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "44",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\cclast2.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\cclast2.jpg",
        "bname": "",
        "detail": ""
    },
    {
        "id": "45",
        "imgsrc_fr": "assets\\images\\prabhupadaBooks\\bg-front.jpg",
        "imgsrc_bc": "assets\\images\\prabhupadaBooks\\BhagavadGita.jpg",
        "bname": "ஸ்ரீமத் பகவத் கீதை - உண்மையுருவில் ",
        "detail": "உலகிலேயே மிகவும் பிரசித்தி பெற்ற பகவத் கீதை வேத ஞானத்தின் மணிமகுடமாக உலகம் முழுவதும் உணரப்படும் பகவத் கீதை, முழுமுதற் கடவுளான ஸ்ரீ கிருஷ்ணரால் அவரது நெருங்கிய பக்தரான அர்ஜுனனுக்கு உபதேசிக்கப்பட்டது. கீதையின் எழுநூறு ஸ்லோகங்களும் மனித சமுதாயத்தின் ஆன்மீக முன்னேற்றத்திற்கு மிகச்சிறந்த வழிகாட்டியாக விளங்குகின்றன. ஆன்மீக விஞ்ஞானத்தை அறிவதில் கீதைக்கு இணை வேறெதுவும் இல்லை என்றால் அது மிகையாகாது. இந்த வெளியீட்டின் தனிச்சிறப்பு அகில உலக கிருஷ்ண பக்தி இயக்கத்தின் ஸ்தாபக ஆச்சாரியாரும், உலகின் தலைசிறந்த வேத பண்டிதருமான தெய்வத்திரு அ.ச.பக்திவேதாந்த சுவாமி பிரபுபாதர், இந்நூலில் பகவான் ஸ்ரீ கிருஷ்ணரிடம் இருந்து தொடங்கிய ஆச்சாரிய பரம்பரையில் பெறப்பட்ட ஞானத்தை அப்படியே வழங்குகின்றார். பகவத் கீதைக்கு பலர் விளக்கவுரை வழங்கியுள்ளனர். ஆனால் அந்நூல்களால் ஒரே ஒரு மனிதனைக்கூட பூரண கிருஷ்ண பக்தனாக்க இயலவில்லை . இருப்பினும் ஸ்ரீல பிரபுபாதரின் இந்நூல், பார் முழுவதும் கிருஷ்ண பக்தியைப் பரவச்செய்துள்ளது. முழுமுதற் கடவுளான பகவான் ஸ்ரீ கிருஷ்ணர் எவ்வாறு உபதேசித்தாரோ, அர்ஜுனன் எவ்வாறு புரிந்து கொண்டானோ, அவ்வாறே உள்ளது உள்ளபடி, கீதையின் பொருளைச் சிதைக்காமல், ஸ்ரீல பிரபுபாதர் விளக்கமளித்துள்ளதே இதற்கு காரணம். இந்நூல் உலகெங்கிலும் பல்வேறு மொழிகளில் மொழிபெயர்க்கப்பட்டு, வேத ஞானம், தத்துவம், பண்பாடு ஆகியவற்றில் மாபெரும் சீர்திருத்தத்தை ஏற்படுத்தியுள்ளது."
    }
]
